---
kind: method
id: M:Autodesk.Revit.DB.ViewCropRegionShapeManager.RemoveSplit
source: html/7b04c647-cb12-3189-eb56-2251ba46d99b.htm
---
# Autodesk.Revit.DB.ViewCropRegionShapeManager.RemoveSplit Method

Removes any split applied to the view's crop.

## Syntax (C#)
```csharp
public void RemoveSplit()
```

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - The crop of the associated view is not permitted to have multiple regions.